micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
/********************  Bit definition for ADC_CFGR register  ********************/
#define ADC_CFGR_DMAEN        ((uint32_t)0x00000001) /*!< ADC DMA Enable */
#define ADC_CFGR_DMACFG       ((uint32_t)0x00000002) /*!< ADC DMA configuration */
                             
#define ADC_CFGR_RES          ((uint32_t)0x00000018) /*!< ADC Data resolution */
#define ADC_CFGR_RES_0        ((uint32_t)0x00000008) /*!< ADC RES bit 0 */
#define ADC_CFGR_RES_1        ((uint32_t)0x00000010) /*!< ADC RES bit 1 */
                             
#define ADC_CFGR_ALIGN        ((uint32_t)0x00000020) /*!< ADC Data Alignement */
                             
#define ADC_CFGR_EXTSEL      ((uint32_t)0x000003C0) /*!< ADC External trigger selection for regular group */
#define ADC_CFGR_EXTSEL_0    ((uint32_t)0x00000040) /*!< ADC EXTSEL bit 0 */
#define ADC_CFGR_EXTSEL_1    ((uint32_t)0x00000080) /*!< ADC EXTSEL bit 1 */
#define ADC_CFGR_EXTSEL_2    ((uint32_t)0x00000100) /*!< ADC EXTSEL bit 2 */
#define ADC_CFGR_EXTSEL_3    ((uint32_t)0x00000200) /*!< ADC EXTSEL bit 3 */
                             
#define ADC_CFGR_EXTEN        ((uint32_t)0x00000C00) /*!< ADC External trigger enable and polarity selection for regular channels */
#define ADC_CFGR_EXTEN_0      ((uint32_t)0x00000400) /*!< ADC EXTEN bit 0 */
#define ADC_CFGR_EXTEN_1      ((uint32_t)0x00000800) /*!< ADC EXTEN bit 1 */
                             
#define ADC_CFGR_OVRMOD       ((uint32_t)0x00001000) /*!< ADC overrun mode */
#define ADC_CFGR_CONT         ((uint32_t)0x00002000) /*!< ADC Single/continuous conversion mode for regular conversion */
#define ADC_CFGR_AUTDLY       ((uint32_t)0x00004000) /*!< ADC Delayed conversion mode */

#define ADC_CFGR_DISCEN       ((uint32_t)0x00010000) /*!< ADC Discontinuous mode for regular channels */
                             
#define ADC_CFGR_DISCNUM      ((uint32_t)0x000E0000) /*!< ADC Discontinuous mode channel count */
#define ADC_CFGR_DISCNUM_0    ((uint32_t)0x00020000) /*!< ADC DISCNUM bit 0 */
#define ADC_CFGR_DISCNUM_1    ((uint32_t)0x00040000) /*!< ADC DISCNUM bit 1 */
#define ADC_CFGR_DISCNUM_2    ((uint32_t)0x00080000) /*!< ADC DISCNUM bit 2 */
                              
#define ADC_CFGR_JDISCEN      ((uint32_t)0x00100000) /*!< ADC Discontinuous mode on injected channels */
#define ADC_CFGR_JQM          ((uint32_t)0x00200000) /*!< ADC JSQR Queue mode */
#define ADC_CFGR_AWD1SGL      ((uint32_t)0x00400000) /*!< Enable the watchdog 1 on a single channel or on all channels */
#define ADC_CFGR_AWD1EN       ((uint32_t)0x00800000) /*!< ADC Analog watchdog 1 enable on regular Channels */
#define ADC_CFGR_JAWD1EN      ((uint32_t)0x01000000) /*!< ADC Analog watchdog 1 enable on injected Channels */
#define ADC_CFGR_JAUTO        ((uint32_t)0x02000000) /*!< ADC Automatic injected group conversion */
                              
#define ADC_CFGR_AWD1CH       ((uint32_t)0x7C000000) /*!< ADC Analog watchdog 1 Channel selection */
#define ADC_CFGR_AWD1CH_0     ((uint32_t)0x04000000) /*!< ADC AWD1CH bit 0 */
#define ADC_CFGR_AWD1CH_1     ((uint32_t)0x08000000) /*!< ADC AWD1CH bit 1  */
#define ADC_CFGR_AWD1CH_2     ((uint32_t)0x10000000) /*!< ADC AWD1CH bit 2  */
#define ADC_CFGR_AWD1CH_3     ((uint32_t)0x20000000) /*!< ADC AWD1CH bit 3  */
#define ADC_CFGR_AWD1CH_4     ((uint32_t)0x40000000) /*!< ADC AWD1CH bit 4  */
                              
#define ADC_CFGR_JQDIS        ((uint32_t)0x80000000) /*!< ADC Injected queue disable */

/********************  Bit definition for ADC_CFGR2 register  ********************/
#define ADC_CFGR2_ROVSE       ((uint32_t)0x00000001) /*!< ADC Regular group oversampler enable */
#define ADC_CFGR2_JOVSE       ((uint32_t)0x00000002) /*!< ADC Injected group oversampler enable */
                           
#define ADC_CFGR2_OVSR        ((uint32_t)0x0000001C) /*!< ADC Regular group oversampler enable */
#define ADC_CFGR2_OVSR_0      ((uint32_t)0x00000004) /*!< ADC OVSR bit 0 */
#define ADC_CFGR2_OVSR_1      ((uint32_t)0x00000008) /*!< ADC OVSR bit 1 */
#define ADC_CFGR2_OVSR_2      ((uint32_t)0x00000010) /*!< ADC OVSR bit 2 */
                           
#define ADC_CFGR2_OVSS        ((uint32_t)0x000001E0) /*!< ADC Regular Oversampling shift */
#define ADC_CFGR2_OVSS_0      ((uint32_t)0x00000020) /*!< ADC OVSS bit 0 */
#define ADC_CFGR2_OVSS_1      ((uint32_t)0x00000040) /*!< ADC OVSS bit 1 */
#define ADC_CFGR2_OVSS_2      ((uint32_t)0x00000080) /*!< ADC OVSS bit 2 */
#define ADC_CFGR2_OVSS_3      ((uint32_t)0x00000100) /*!< ADC OVSS bit 3 */
                           
#define ADC_CFGR2_TROVS       ((uint32_t)0x00000200) /*!< ADC Triggered regular Oversampling */
#define ADC_CFGR2_ROVSM       ((uint32_t)0x00000400) /*!< ADC Regular oversampling mode */
                           
/********************  Bit definition for ADC_SMPR1 register  ********************/
#define ADC_SMPR1_SMP0        ((uint32_t)0x00000007) /*!< ADC Channel 0 Sampling time selection  */
#define ADC_SMPR1_SMP0_0      ((uint32_t)0x00000001) /*!< ADC SMP0 bit 0 */
#define ADC_SMPR1_SMP0_1      ((uint32_t)0x00000002) /*!< ADC SMP0 bit 1 */
#define ADC_SMPR1_SMP0_2      ((uint32_t)0x00000004) /*!< ADC SMP0 bit 2 */
                             
#define ADC_SMPR1_SMP1        ((uint32_t)0x00000038) /*!< ADC Channel 1 Sampling time selection  */
#define ADC_SMPR1_SMP1_0      ((uint32_t)0x00000008) /*!< ADC SMP1 bit 0 */
#define ADC_SMPR1_SMP1_1      ((uint32_t)0x00000010) /*!< ADC SMP1 bit 1 */
#define ADC_SMPR1_SMP1_2      ((uint32_t)0x00000020) /*!< ADC SMP1 bit 2 */
                             
#define ADC_SMPR1_SMP2        ((uint32_t)0x000001C0) /*!< ADC Channel 2 Sampling time selection  */
#define ADC_SMPR1_SMP2_0      ((uint32_t)0x00000040) /*!< ADC SMP2 bit 0 */
#define ADC_SMPR1_SMP2_1      ((uint32_t)0x00000080) /*!< ADC SMP2 bit 1 */
#define ADC_SMPR1_SMP2_2      ((uint32_t)0x00000100) /*!< ADC SMP2 bit 2 */
                             
#define ADC_SMPR1_SMP3        ((uint32_t)0x00000E00) /*!< ADC Channel 3 Sampling time selection  */
#define ADC_SMPR1_SMP3_0      ((uint32_t)0x00000200) /*!< ADC SMP3 bit 0 */
#define ADC_SMPR1_SMP3_1      ((uint32_t)0x00000400) /*!< ADC SMP3 bit 1 */
#define ADC_SMPR1_SMP3_2      ((uint32_t)0x00000800) /*!< ADC SMP3 bit 2 */
                             
#define ADC_SMPR1_SMP4        ((uint32_t)0x00007000) /*!< ADC Channel 4 Sampling time selection  */
#define ADC_SMPR1_SMP4_0      ((uint32_t)0x00001000) /*!< ADC SMP4 bit 0 */
#define ADC_SMPR1_SMP4_1      ((uint32_t)0x00002000) /*!< ADC SMP4 bit 1 */
#define ADC_SMPR1_SMP4_2      ((uint32_t)0x00004000) /*!< ADC SMP4 bit 2 */
                             
#define ADC_SMPR1_SMP5        ((uint32_t)0x00038000) /*!< ADC Channel 5 Sampling time selection  */
#define ADC_SMPR1_SMP5_0      ((uint32_t)0x00008000) /*!< ADC SMP5 bit 0 */
#define ADC_SMPR1_SMP5_1      ((uint32_t)0x00010000) /*!< ADC SMP5 bit 1 */
#define ADC_SMPR1_SMP5_2      ((uint32_t)0x00020000) /*!< ADC SMP5 bit 2 */
                             
#define ADC_SMPR1_SMP6        ((uint32_t)0x001C0000) /*!< ADC Channel 6 Sampling time selection  */
#define ADC_SMPR1_SMP6_0      ((uint32_t)0x00040000) /*!< ADC SMP6 bit 0 */
#define ADC_SMPR1_SMP6_1      ((uint32_t)0x00080000) /*!< ADC SMP6 bit 1 */
#define ADC_SMPR1_SMP6_2      ((uint32_t)0x00100000) /*!< ADC SMP6 bit 2 */
                             
#define ADC_SMPR1_SMP7        ((uint32_t)0x00E00000) /*!< ADC Channel 7 Sampling time selection  */
#define ADC_SMPR1_SMP7_0      ((uint32_t)0x00200000) /*!< ADC SMP7 bit 0 */
#define ADC_SMPR1_SMP7_1      ((uint32_t)0x00400000) /*!< ADC SMP7 bit 1 */
#define ADC_SMPR1_SMP7_2      ((uint32_t)0x00800000) /*!< ADC SMP7 bit 2 */
                             
#define ADC_SMPR1_SMP8        ((uint32_t)0x07000000) /*!< ADC Channel 8 Sampling time selection  */
#define ADC_SMPR1_SMP8_0      ((uint32_t)0x01000000) /*!< ADC SMP8 bit 0 */
#define ADC_SMPR1_SMP8_1      ((uint32_t)0x02000000) /*!< ADC SMP8 bit 1 */
#define ADC_SMPR1_SMP8_2      ((uint32_t)0x04000000) /*!< ADC SMP8 bit 2 */
                             
#define ADC_SMPR1_SMP9        ((uint32_t)0x38000000) /*!< ADC Channel 9 Sampling time selection  */
#define ADC_SMPR1_SMP9_0      ((uint32_t)0x08000000) /*!< ADC SMP9 bit 0 */
#define ADC_SMPR1_SMP9_1      ((uint32_t)0x10000000) /*!< ADC SMP9 bit 1 */
#define ADC_SMPR1_SMP9_2      ((uint32_t)0x20000000) /*!< ADC SMP9 bit 2 */

/********************  Bit definition for ADC_SMPR2 register  ********************/
#define ADC_SMPR2_SMP10     ((uint32_t)0x00000007) /*!< ADC Channel 10 Sampling time selection  */
#define ADC_SMPR2_SMP10_0   ((uint32_t)0x00000001) /*!< ADC SMP10 bit 0 */
#define ADC_SMPR2_SMP10_1   ((uint32_t)0x00000002) /*!< ADC SMP10 bit 1 */
#define ADC_SMPR2_SMP10_2   ((uint32_t)0x00000004) /*!< ADC SMP10 bit 2 */

