micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
/*******************  Bit definition for EXTI_EMR2 register  ******************/
#define  EXTI_EMR2_EM32                      ((uint32_t)0x00000001)        /*!< Event Mask on line 32 */
#define  EXTI_EMR2_EM33                      ((uint32_t)0x00000002)        /*!< Event Mask on line 33 */
#define  EXTI_EMR2_EM34                      ((uint32_t)0x00000004)        /*!< Event Mask on line 34 */
#define  EXTI_EMR2_EM35                      ((uint32_t)0x00000008)        /*!< Event Mask on line 35 */
#define  EXTI_EMR2_EM36                      ((uint32_t)0x00000010)        /*!< Event Mask on line 36 */
#define  EXTI_EMR2_EM37                      ((uint32_t)0x00000020)        /*!< Event Mask on line 37 */
#define  EXTI_EMR2_EM38                      ((uint32_t)0x00000040)        /*!< Event Mask on line 38 */
#define  EXTI_EMR2_EM39                      ((uint32_t)0x00000080)        /*!< Event Mask on line 39 */

/******************  Bit definition for EXTI_RTSR2 register  ******************/
#define  EXTI_RTSR2_RT35                     ((uint32_t)0x00000008)        /*!< Rising trigger event configuration bit of line 35 */
#define  EXTI_RTSR2_RT36                     ((uint32_t)0x00000010)        /*!< Rising trigger event configuration bit of line 36 */
#define  EXTI_RTSR2_RT37                     ((uint32_t)0x00000020)        /*!< Rising trigger event configuration bit of line 37 */
#define  EXTI_RTSR2_RT38                     ((uint32_t)0x00000040)        /*!< Rising trigger event configuration bit of line 38 */

/******************  Bit definition for EXTI_FTSR2 register  ******************/
#define  EXTI_FTSR2_FT35                     ((uint32_t)0x00000008)        /*!< Falling trigger event configuration bit of line 35 */
#define  EXTI_FTSR2_FT36                     ((uint32_t)0x00000010)        /*!< Falling trigger event configuration bit of line 36 */
#define  EXTI_FTSR2_FT37                     ((uint32_t)0x00000020)        /*!< Falling trigger event configuration bit of line 37 */
#define  EXTI_FTSR2_FT38                     ((uint32_t)0x00000040)        /*!< Falling trigger event configuration bit of line 38 */

/******************  Bit definition for EXTI_SWIER2 register  *****************/
#define  EXTI_SWIER2_SWI35                   ((uint32_t)0x00000008)        /*!< Software Interrupt on line 35 */
#define  EXTI_SWIER2_SWI36                   ((uint32_t)0x00000010)        /*!< Software Interrupt on line 36 */
#define  EXTI_SWIER2_SWI37                   ((uint32_t)0x00000020)        /*!< Software Interrupt on line 37 */
#define  EXTI_SWIER2_SWI38                   ((uint32_t)0x00000040)        /*!< Software Interrupt on line 38 */

/*******************  Bit definition for EXTI_PR2 register  *******************/
#define  EXTI_PR2_PIF35                       ((uint32_t)0x00000008)        /*!< Pending bit for line 35 */
#define  EXTI_PR2_PIF36                       ((uint32_t)0x00000010)        /*!< Pending bit for line 36 */
#define  EXTI_PR2_PIF37                       ((uint32_t)0x00000020)        /*!< Pending bit for line 37 */
#define  EXTI_PR2_PIF38                       ((uint32_t)0x00000040)        /*!< Pending bit for line 38 */


/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY                    ((uint32_t)0x00000007)
#define FLASH_ACR_LATENCY_0WS                ((uint32_t)0x00000000)
#define FLASH_ACR_LATENCY_1WS                ((uint32_t)0x00000001)
#define FLASH_ACR_LATENCY_2WS                ((uint32_t)0x00000002)
#define FLASH_ACR_LATENCY_3WS                ((uint32_t)0x00000003)
#define FLASH_ACR_LATENCY_4WS                ((uint32_t)0x00000004)
#define FLASH_ACR_PRFTEN                     ((uint32_t)0x00000100)
#define FLASH_ACR_ICEN                       ((uint32_t)0x00000200)
#define FLASH_ACR_DCEN                       ((uint32_t)0x00000400)
#define FLASH_ACR_ICRST                      ((uint32_t)0x00000800)
#define FLASH_ACR_DCRST                      ((uint32_t)0x00001000)
#define FLASH_ACR_RUN_PD                     ((uint32_t)0x00002000)   /*!< Flash power down mode during run */
#define FLASH_ACR_SLEEP_PD                   ((uint32_t)0x00004000)   /*!< Flash power down mode during sleep */

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP                         ((uint32_t)0x00000001)
#define FLASH_SR_OPERR                       ((uint32_t)0x00000002)
#define FLASH_SR_PROGERR                     ((uint32_t)0x00000008)
#define FLASH_SR_WRPERR                      ((uint32_t)0x00000010)
#define FLASH_SR_PGAERR                      ((uint32_t)0x00000020)
#define FLASH_SR_SIZERR                      ((uint32_t)0x00000040)
#define FLASH_SR_PGSERR                      ((uint32_t)0x00000080)
#define FLASH_SR_MISERR                      ((uint32_t)0x00000100)
#define FLASH_SR_FASTERR                     ((uint32_t)0x00000200)
#define FLASH_SR_RDERR                       ((uint32_t)0x00004000)
#define FLASH_SR_OPTVERR                     ((uint32_t)0x00008000)
#define FLASH_SR_BSY                         ((uint32_t)0x00010000)

/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG                          ((uint32_t)0x00000001)
#define FLASH_CR_PER                         ((uint32_t)0x00000002)
#define FLASH_CR_MER1                        ((uint32_t)0x00000004)
#define FLASH_CR_PNB                         ((uint32_t)0x000007F8)
/*#define FLASH_CR_PNB_0                       ((uint32_t)0x00000008)
#define FLASH_CR_PNB_1                       ((uint32_t)0x00000010)
#define FLASH_CR_PNB_2                       ((uint32_t)0x00000020)
#define FLASH_CR_PNB_3                       ((uint32_t)0x00000040)
#define FLASH_CR_PNB_4                       ((uint32_t)0x00000080)
#define FLASH_CR_PNB_5                       ((uint32_t)0x00000100)
#define FLASH_CR_PNB_6                       ((uint32_t)0x00000200)
#define FLASH_CR_PNB_7                       ((uint32_t)0x00000400)*/
#define FLASH_CR_BKER                        ((uint32_t)0x00000800)
#define FLASH_CR_MER2                        ((uint32_t)0x00008000)
#define FLASH_CR_STRT                        ((uint32_t)0x00010000)
#define FLASH_CR_OPTSTRT                     ((uint32_t)0x00020000)
#define FLASH_CR_FSTPG                       ((uint32_t)0x00040000)
#define FLASH_CR_EOPIE                       ((uint32_t)0x01000000)
#define FLASH_CR_ERRIE                       ((uint32_t)0x02000000)
#define FLASH_CR_RDERRIE                     ((uint32_t)0x04000000)
#define FLASH_CR_OBL_LAUNCH                  ((uint32_t)0x08000000)
#define FLASH_CR_OPTLOCK                     ((uint32_t)0x40000000)
#define FLASH_CR_LOCK                        ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_ECCR register  ***************/
#define FLASH_ECCR_ADDR_ECC                 ((uint32_t)0x0007FFFF)
/*#define FLASH_ECCR_ADDR_ECC_0               ((uint32_t)0x00000001)
#define FLASH_ECCR_ADDR_ECC_1               ((uint32_t)0x00000002)
#define FLASH_ECCR_ADDR_ECC_2               ((uint32_t)0x00000004)
#define FLASH_ECCR_ADDR_ECC_3               ((uint32_t)0x00000008)
#define FLASH_ECCR_ADDR_ECC_4               ((uint32_t)0x00000010)
#define FLASH_ECCR_ADDR_ECC_5               ((uint32_t)0x00000020)
#define FLASH_ECCR_ADDR_ECC_6               ((uint32_t)0x00000040)
#define FLASH_ECCR_ADDR_ECC_7               ((uint32_t)0x00000080)
#define FLASH_ECCR_ADDR_ECC_8               ((uint32_t)0x00000100)
#define FLASH_ECCR_ADDR_ECC_9               ((uint32_t)0x00000200)
#define FLASH_ECCR_ADDR_ECC_10              ((uint32_t)0x00000400)
#define FLASH_ECCR_ADDR_ECC_11              ((uint32_t)0x00000800)
#define FLASH_ECCR_ADDR_ECC_12              ((uint32_t)0x00001000)
#define FLASH_ECCR_ADDR_ECC_13              ((uint32_t)0x00002000)
#define FLASH_ECCR_ADDR_ECC_14              ((uint32_t)0x00004000)
#define FLASH_ECCR_ADDR_ECC_15              ((uint32_t)0x00008000)
#define FLASH_ECCR_ADDR_ECC_16              ((uint32_t)0x00010000)
#define FLASH_ECCR_ADDR_ECC_17              ((uint32_t)0x00020000)
#define FLASH_ECCR_ADDR_ECC_18              ((uint32_t)0x00040000)*/
#define FLASH_ECCR_BK_ECC                   ((uint32_t)0x00080000)
#define FLASH_ECCR_SYSF_ECC                 ((uint32_t)0x00100000)
#define FLASH_ECCR_ECCIE                    ((uint32_t)0x01000000)
#define FLASH_ECCR_ECCC                     ((uint32_t)0x40000000)
#define FLASH_ECCR_ECCD                     ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_OPTR register  ***************/
#define FLASH_OPTR_RDP                      ((uint32_t)0x000000FF)
/*#define FLASH_OPTR_RDP_0                    ((uint32_t)0x00000001)
#define FLASH_OPTR_RDP_1                    ((uint32_t)0x00000002)
#define FLASH_OPTR_RDP_2                    ((uint32_t)0x00000004)
#define FLASH_OPTR_RDP_3                    ((uint32_t)0x00000008)
#define FLASH_OPTR_RDP_4                    ((uint32_t)0x00000010)
#define FLASH_OPTR_RDP_5                    ((uint32_t)0x00000020)
#define FLASH_OPTR_RDP_6                    ((uint32_t)0x00000040)
#define FLASH_OPTR_RDP_7                    ((uint32_t)0x00000080)*/
#define FLASH_OPTR_BOR_LEV                  ((uint32_t)0x00000700)
#define FLASH_OPTR_BOR_LEV_0                ((uint32_t)0x00000000)
#define FLASH_OPTR_BOR_LEV_1                ((uint32_t)0x00000100)
#define FLASH_OPTR_BOR_LEV_2                ((uint32_t)0x00000200)
#define FLASH_OPTR_BOR_LEV_3                ((uint32_t)0x00000300)
#define FLASH_OPTR_BOR_LEV_4                ((uint32_t)0x00000400)
#define FLASH_OPTR_nRST_STOP                ((uint32_t)0x00001000)
#define FLASH_OPTR_nRST_STDBY               ((uint32_t)0x00002000)
#define FLASH_OPTR_nRST_SHDW                ((uint32_t)0x00004000)
#define FLASH_OPTR_IWDG_SW                  ((uint32_t)0x00010000)
#define FLASH_OPTR_IWDG_STOP                ((uint32_t)0x00020000)
#define FLASH_OPTR_IWDG_STDBY               ((uint32_t)0x00040000)
#define FLASH_OPTR_WWDG_SW                  ((uint32_t)0x00080000)
#define FLASH_OPTR_BFB2                     ((uint32_t)0x00100000)
#define FLASH_OPTR_DUALBANK                 ((uint32_t)0x00200000)
#define FLASH_OPTR_nBOOT1                   ((uint32_t)0x00800000)
#define FLASH_OPTR_SRAM2_PE                 ((uint32_t)0x01000000)
#define FLASH_OPTR_SRAM2_RST                ((uint32_t)0x02000000)

/******************  Bits definition for FLASH_PCROP1SR register  **********/
#define FLASH_PCROP1SR_PCROP1_STRT          ((uint32_t)0x0000FFFF)

/******************  Bits definition for FLASH_PCROP1ER register  ***********/
#define FLASH_PCROP1ER_PCROP1_END           ((uint32_t)0x0000FFFF)
#define FLASH_PCROP1ER_PCROP_RDP            ((uint32_t)0x80000000)

/******************  Bits definition for FLASH_WRP1AR register  ***************/
#define FLASH_WRP1AR_WRP1A_STRT             ((uint32_t)0x000000FF)
#define FLASH_WRP1AR_WRP1A_END              ((uint32_t)0x00FF0000)

/******************  Bits definition for FLASH_WRPB1R register  ***************/
#define FLASH_WRP1BR_WRP1B_STRT             ((uint32_t)0x000000FF)
#define FLASH_WRP1BR_WRP1B_END              ((uint32_t)0x00FF0000)

