micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
/******************  Bit definition for FMC_ECCR register  *******************/
#define  FMC_ECCR_ECC                       ((uint32_t)0xFFFFFFFF)        /*!<ECC result */

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODE0                    ((uint32_t)0x00000003)
#define GPIO_MODER_MODE0_0                  ((uint32_t)0x00000001)
#define GPIO_MODER_MODE0_1                  ((uint32_t)0x00000002)
#define GPIO_MODER_MODE1                    ((uint32_t)0x0000000C)
#define GPIO_MODER_MODE1_0                  ((uint32_t)0x00000004)
#define GPIO_MODER_MODE1_1                  ((uint32_t)0x00000008)
#define GPIO_MODER_MODE2                    ((uint32_t)0x00000030)
#define GPIO_MODER_MODE2_0                  ((uint32_t)0x00000010)
#define GPIO_MODER_MODE2_1                  ((uint32_t)0x00000020)
#define GPIO_MODER_MODE3                    ((uint32_t)0x000000C0)
#define GPIO_MODER_MODE3_0                  ((uint32_t)0x00000040)
#define GPIO_MODER_MODE3_1                  ((uint32_t)0x00000080)
#define GPIO_MODER_MODE4                    ((uint32_t)0x00000300)
#define GPIO_MODER_MODE4_0                  ((uint32_t)0x00000100)
#define GPIO_MODER_MODE4_1                  ((uint32_t)0x00000200)
#define GPIO_MODER_MODE5                    ((uint32_t)0x00000C00)
#define GPIO_MODER_MODE5_0                  ((uint32_t)0x00000400)
#define GPIO_MODER_MODE5_1                  ((uint32_t)0x00000800)
#define GPIO_MODER_MODE6                    ((uint32_t)0x00003000)
#define GPIO_MODER_MODE6_0                  ((uint32_t)0x00001000)
#define GPIO_MODER_MODE6_1                  ((uint32_t)0x00002000)
#define GPIO_MODER_MODE7                    ((uint32_t)0x0000C000)
#define GPIO_MODER_MODE7_0                  ((uint32_t)0x00004000)
#define GPIO_MODER_MODE7_1                  ((uint32_t)0x00008000)
#define GPIO_MODER_MODE8                    ((uint32_t)0x00030000)
#define GPIO_MODER_MODE8_0                  ((uint32_t)0x00010000)
#define GPIO_MODER_MODE8_1                  ((uint32_t)0x00020000)
#define GPIO_MODER_MODE9                    ((uint32_t)0x000C0000)
#define GPIO_MODER_MODE9_0                  ((uint32_t)0x00040000)
#define GPIO_MODER_MODE9_1                  ((uint32_t)0x00080000)
#define GPIO_MODER_MODE10                   ((uint32_t)0x00300000)
#define GPIO_MODER_MODE10_0                 ((uint32_t)0x00100000)
#define GPIO_MODER_MODE10_1                 ((uint32_t)0x00200000)
#define GPIO_MODER_MODE11                   ((uint32_t)0x00C00000)
#define GPIO_MODER_MODE11_0                 ((uint32_t)0x00400000)
#define GPIO_MODER_MODE11_1                 ((uint32_t)0x00800000)
#define GPIO_MODER_MODE12                   ((uint32_t)0x03000000)
#define GPIO_MODER_MODE12_0                 ((uint32_t)0x01000000)
#define GPIO_MODER_MODE12_1                 ((uint32_t)0x02000000)
#define GPIO_MODER_MODE13                   ((uint32_t)0x0C000000)
#define GPIO_MODER_MODE13_0                 ((uint32_t)0x04000000)
#define GPIO_MODER_MODE13_1                 ((uint32_t)0x08000000)
#define GPIO_MODER_MODE14                   ((uint32_t)0x30000000)
#define GPIO_MODER_MODE14_0                 ((uint32_t)0x10000000)
#define GPIO_MODER_MODE14_1                 ((uint32_t)0x20000000)
#define GPIO_MODER_MODE15                   ((uint32_t)0xC0000000)
#define GPIO_MODER_MODE15_0                 ((uint32_t)0x40000000)
#define GPIO_MODER_MODE15_1                 ((uint32_t)0x80000000)

/******************  Bits definition for GPIO_OTYPER register  ****************/
#define GPIO_OTYPER_OT0                     ((uint32_t)0x00000001U)
#define GPIO_OTYPER_OT1                     ((uint32_t)0x00000002U)
#define GPIO_OTYPER_OT2                     ((uint32_t)0x00000004U)
#define GPIO_OTYPER_OT3                     ((uint32_t)0x00000008U)
#define GPIO_OTYPER_OT4                     ((uint32_t)0x00000010U)
#define GPIO_OTYPER_OT5                     ((uint32_t)0x00000020U)
#define GPIO_OTYPER_OT6                     ((uint32_t)0x00000040U)
#define GPIO_OTYPER_OT7                     ((uint32_t)0x00000080U)
#define GPIO_OTYPER_OT8                     ((uint32_t)0x00000100U)
#define GPIO_OTYPER_OT9                     ((uint32_t)0x00000200U)
#define GPIO_OTYPER_OT10                    ((uint32_t)0x00000400U)
#define GPIO_OTYPER_OT11                    ((uint32_t)0x00000800U)
#define GPIO_OTYPER_OT12                    ((uint32_t)0x00001000U)
#define GPIO_OTYPER_OT13                    ((uint32_t)0x00002000U)
#define GPIO_OTYPER_OT14                    ((uint32_t)0x00004000U)
#define GPIO_OTYPER_OT15                    ((uint32_t)0x00008000U)

/* Legacy defines */
#define GPIO_OTYPER_OT_0                    GPIO_OTYPER_OT0
#define GPIO_OTYPER_OT_1                    GPIO_OTYPER_OT1
#define GPIO_OTYPER_OT_2                    GPIO_OTYPER_OT2
#define GPIO_OTYPER_OT_3                    GPIO_OTYPER_OT3
#define GPIO_OTYPER_OT_4                    GPIO_OTYPER_OT4
#define GPIO_OTYPER_OT_5                    GPIO_OTYPER_OT5
#define GPIO_OTYPER_OT_6                    GPIO_OTYPER_OT6
#define GPIO_OTYPER_OT_7                    GPIO_OTYPER_OT7
#define GPIO_OTYPER_OT_8                    GPIO_OTYPER_OT8
#define GPIO_OTYPER_OT_9                    GPIO_OTYPER_OT9
#define GPIO_OTYPER_OT_10                   GPIO_OTYPER_OT10
#define GPIO_OTYPER_OT_11                   GPIO_OTYPER_OT11
#define GPIO_OTYPER_OT_12                   GPIO_OTYPER_OT12
#define GPIO_OTYPER_OT_13                   GPIO_OTYPER_OT13
#define GPIO_OTYPER_OT_14                   GPIO_OTYPER_OT14
#define GPIO_OTYPER_OT_15                   GPIO_OTYPER_OT15

