micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
/******************  Bits definition for GPIO_PUPDR register  *****************/
#define GPIO_PUPDR_PUPD0                    ((uint32_t)0x00000003)
#define GPIO_PUPDR_PUPD0_0                  ((uint32_t)0x00000001)
#define GPIO_PUPDR_PUPD0_1                  ((uint32_t)0x00000002)
#define GPIO_PUPDR_PUPD1                    ((uint32_t)0x0000000C)
#define GPIO_PUPDR_PUPD1_0                  ((uint32_t)0x00000004)
#define GPIO_PUPDR_PUPD1_1                  ((uint32_t)0x00000008)
#define GPIO_PUPDR_PUPD2                    ((uint32_t)0x00000030)
#define GPIO_PUPDR_PUPD2_0                  ((uint32_t)0x00000010)
#define GPIO_PUPDR_PUPD2_1                  ((uint32_t)0x00000020)
#define GPIO_PUPDR_PUPD3                    ((uint32_t)0x000000C0)
#define GPIO_PUPDR_PUPD3_0                  ((uint32_t)0x00000040)
#define GPIO_PUPDR_PUPD3_1                  ((uint32_t)0x00000080)
#define GPIO_PUPDR_PUPD4                    ((uint32_t)0x00000300)
#define GPIO_PUPDR_PUPD4_0                  ((uint32_t)0x00000100)
#define GPIO_PUPDR_PUPD4_1                  ((uint32_t)0x00000200)
#define GPIO_PUPDR_PUPD5                    ((uint32_t)0x00000C00)
#define GPIO_PUPDR_PUPD5_0                  ((uint32_t)0x00000400)
#define GPIO_PUPDR_PUPD5_1                  ((uint32_t)0x00000800)
#define GPIO_PUPDR_PUPD6                    ((uint32_t)0x00003000)
#define GPIO_PUPDR_PUPD6_0                  ((uint32_t)0x00001000)
#define GPIO_PUPDR_PUPD6_1                  ((uint32_t)0x00002000)
#define GPIO_PUPDR_PUPD7                    ((uint32_t)0x0000C000)
#define GPIO_PUPDR_PUPD7_0                  ((uint32_t)0x00004000)
#define GPIO_PUPDR_PUPD7_1                  ((uint32_t)0x00008000)
#define GPIO_PUPDR_PUPD8                    ((uint32_t)0x00030000)
#define GPIO_PUPDR_PUPD8_0                  ((uint32_t)0x00010000)
#define GPIO_PUPDR_PUPD8_1                  ((uint32_t)0x00020000)
#define GPIO_PUPDR_PUPD9                    ((uint32_t)0x000C0000)
#define GPIO_PUPDR_PUPD9_0                  ((uint32_t)0x00040000)
#define GPIO_PUPDR_PUPD9_1                  ((uint32_t)0x00080000)
#define GPIO_PUPDR_PUPD10                   ((uint32_t)0x00300000)
#define GPIO_PUPDR_PUPD10_0                 ((uint32_t)0x00100000)
#define GPIO_PUPDR_PUPD10_1                 ((uint32_t)0x00200000)
#define GPIO_PUPDR_PUPD11                   ((uint32_t)0x00C00000)
#define GPIO_PUPDR_PUPD11_0                 ((uint32_t)0x00400000)
#define GPIO_PUPDR_PUPD11_1                 ((uint32_t)0x00800000)
#define GPIO_PUPDR_PUPD12                   ((uint32_t)0x03000000)
#define GPIO_PUPDR_PUPD12_0                 ((uint32_t)0x01000000)
#define GPIO_PUPDR_PUPD12_1                 ((uint32_t)0x02000000)
#define GPIO_PUPDR_PUPD13                   ((uint32_t)0x0C000000)
#define GPIO_PUPDR_PUPD13_0                 ((uint32_t)0x04000000)
#define GPIO_PUPDR_PUPD13_1                 ((uint32_t)0x08000000)
#define GPIO_PUPDR_PUPD14                   ((uint32_t)0x30000000)
#define GPIO_PUPDR_PUPD14_0                 ((uint32_t)0x10000000)
#define GPIO_PUPDR_PUPD14_1                 ((uint32_t)0x20000000)
#define GPIO_PUPDR_PUPD15                   ((uint32_t)0xC0000000)
#define GPIO_PUPDR_PUPD15_0                 ((uint32_t)0x40000000)
#define GPIO_PUPDR_PUPD15_1                 ((uint32_t)0x80000000)

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_IDR_IDR0                       ((uint32_t)0x00000001)
#define GPIO_IDR_IDR1                       ((uint32_t)0x00000002)
#define GPIO_IDR_IDR2                       ((uint32_t)0x00000004)
#define GPIO_IDR_IDR3                       ((uint32_t)0x00000008)
#define GPIO_IDR_IDR4                       ((uint32_t)0x00000010)
#define GPIO_IDR_IDR5                       ((uint32_t)0x00000020)
#define GPIO_IDR_IDR6                       ((uint32_t)0x00000040)
#define GPIO_IDR_IDR7                       ((uint32_t)0x00000080)
#define GPIO_IDR_IDR8                       ((uint32_t)0x00000100)
#define GPIO_IDR_IDR9                       ((uint32_t)0x00000200)
#define GPIO_IDR_IDR10                      ((uint32_t)0x00000400)
#define GPIO_IDR_IDR11                      ((uint32_t)0x00000800)
#define GPIO_IDR_IDR12                      ((uint32_t)0x00001000)
#define GPIO_IDR_IDR13                      ((uint32_t)0x00002000)
#define GPIO_IDR_IDR14                      ((uint32_t)0x00004000)
#define GPIO_IDR_IDR15                      ((uint32_t)0x00008000)

/* Old GPIO_IDR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_IDR_0                    GPIO_IDR_IDR0
#define GPIO_OTYPER_IDR_1                    GPIO_IDR_IDR1
#define GPIO_OTYPER_IDR_2                    GPIO_IDR_IDR2
#define GPIO_OTYPER_IDR_3                    GPIO_IDR_IDR3
#define GPIO_OTYPER_IDR_4                    GPIO_IDR_IDR4
#define GPIO_OTYPER_IDR_5                    GPIO_IDR_IDR5
#define GPIO_OTYPER_IDR_6                    GPIO_IDR_IDR6
#define GPIO_OTYPER_IDR_7                    GPIO_IDR_IDR7
#define GPIO_OTYPER_IDR_8                    GPIO_IDR_IDR8
#define GPIO_OTYPER_IDR_9                    GPIO_IDR_IDR9
#define GPIO_OTYPER_IDR_10                   GPIO_IDR_IDR10
#define GPIO_OTYPER_IDR_11                   GPIO_IDR_IDR11
#define GPIO_OTYPER_IDR_12                   GPIO_IDR_IDR12
#define GPIO_OTYPER_IDR_13                   GPIO_IDR_IDR13
#define GPIO_OTYPER_IDR_14                   GPIO_IDR_IDR14
#define GPIO_OTYPER_IDR_15                   GPIO_IDR_IDR15

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_ODR_ODR0                       ((uint32_t)0x00000001)
#define GPIO_ODR_ODR1                       ((uint32_t)0x00000002)
#define GPIO_ODR_ODR2                       ((uint32_t)0x00000004)
#define GPIO_ODR_ODR3                       ((uint32_t)0x00000008)
#define GPIO_ODR_ODR4                       ((uint32_t)0x00000010)
#define GPIO_ODR_ODR5                       ((uint32_t)0x00000020)
#define GPIO_ODR_ODR6                       ((uint32_t)0x00000040)
#define GPIO_ODR_ODR7                       ((uint32_t)0x00000080)
#define GPIO_ODR_ODR8                       ((uint32_t)0x00000100)
#define GPIO_ODR_ODR9                       ((uint32_t)0x00000200)
#define GPIO_ODR_ODR10                      ((uint32_t)0x00000400)
#define GPIO_ODR_ODR11                      ((uint32_t)0x00000800)
#define GPIO_ODR_ODR12                      ((uint32_t)0x00001000)
#define GPIO_ODR_ODR13                      ((uint32_t)0x00002000)
#define GPIO_ODR_ODR14                      ((uint32_t)0x00004000)
#define GPIO_ODR_ODR15                      ((uint32_t)0x00008000)

