micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
/****************** Bit definition for GPIO_AFRL register  ********************/
#define GPIO_AFRL_AFRL0                      ((uint32_t)0x0000000F)
#define GPIO_AFRL_AFRL1                      ((uint32_t)0x000000F0)
#define GPIO_AFRL_AFRL2                      ((uint32_t)0x00000F00)
#define GPIO_AFRL_AFRL3                      ((uint32_t)0x0000F000)
#define GPIO_AFRL_AFRL4                      ((uint32_t)0x000F0000)
#define GPIO_AFRL_AFRL5                      ((uint32_t)0x00F00000)
#define GPIO_AFRL_AFRL6                      ((uint32_t)0x0F000000)
#define GPIO_AFRL_AFRL7                      ((uint32_t)0xF0000000)

/****************** Bit definition for GPIO_AFRH register  ********************/
#define GPIO_AFRH_AFRH0                      ((uint32_t)0x0000000F)
#define GPIO_AFRH_AFRH1                      ((uint32_t)0x000000F0)
#define GPIO_AFRH_AFRH2                      ((uint32_t)0x00000F00)
#define GPIO_AFRH_AFRH3                      ((uint32_t)0x0000F000)
#define GPIO_AFRH_AFRH4                      ((uint32_t)0x000F0000)
#define GPIO_AFRH_AFRH5                      ((uint32_t)0x00F00000)
#define GPIO_AFRH_AFRH6                      ((uint32_t)0x0F000000)
#define GPIO_AFRH_AFRH7                      ((uint32_t)0xF0000000)

/******************  Bits definition for GPIO_ASCR register  *******************/
#define GPIO_ASCR_ASC0                      ((uint32_t)0x00000001U)
#define GPIO_ASCR_ASC1                      ((uint32_t)0x00000002U)
#define GPIO_ASCR_ASC2                      ((uint32_t)0x00000004U)
#define GPIO_ASCR_ASC3                      ((uint32_t)0x00000008U)
#define GPIO_ASCR_ASC4                      ((uint32_t)0x00000010U)
#define GPIO_ASCR_ASC5                      ((uint32_t)0x00000020U)
#define GPIO_ASCR_ASC6                      ((uint32_t)0x00000040U)
#define GPIO_ASCR_ASC7                      ((uint32_t)0x00000080U)
#define GPIO_ASCR_ASC8                      ((uint32_t)0x00000100U)
#define GPIO_ASCR_ASC9                      ((uint32_t)0x00000200U)
#define GPIO_ASCR_ASC10                     ((uint32_t)0x00000400U)
#define GPIO_ASCR_ASC11                     ((uint32_t)0x00000800U)
#define GPIO_ASCR_ASC12                     ((uint32_t)0x00001000U)
#define GPIO_ASCR_ASC13                     ((uint32_t)0x00002000U)
#define GPIO_ASCR_ASC14                     ((uint32_t)0x00004000U)
#define GPIO_ASCR_ASC15                     ((uint32_t)0x00008000U)

/* Legacy defines */
#define GPIO_ASCR_EN_0                      GPIO_ASCR_ASC0
#define GPIO_ASCR_EN_1                      GPIO_ASCR_ASC1
#define GPIO_ASCR_EN_2                      GPIO_ASCR_ASC2
#define GPIO_ASCR_EN_3                      GPIO_ASCR_ASC3
#define GPIO_ASCR_EN_4                      GPIO_ASCR_ASC4
#define GPIO_ASCR_EN_5                      GPIO_ASCR_ASC5
#define GPIO_ASCR_EN_6                      GPIO_ASCR_ASC6
#define GPIO_ASCR_EN_7                      GPIO_ASCR_ASC7
#define GPIO_ASCR_EN_8                      GPIO_ASCR_ASC8
#define GPIO_ASCR_EN_9                      GPIO_ASCR_ASC9
#define GPIO_ASCR_EN_10                     GPIO_ASCR_ASC10
#define GPIO_ASCR_EN_11                     GPIO_ASCR_ASC11
#define GPIO_ASCR_EN_12                     GPIO_ASCR_ASC12
#define GPIO_ASCR_EN_13                     GPIO_ASCR_ASC13
#define GPIO_ASCR_EN_14                     GPIO_ASCR_ASC14
#define GPIO_ASCR_EN_15                     GPIO_ASCR_ASC15

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface (I2C)              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CR1 register  *******************/
#define  I2C_CR1_PE                          ((uint32_t)0x00000001)        /*!< Peripheral enable                   */
#define  I2C_CR1_TXIE                        ((uint32_t)0x00000002)        /*!< TX interrupt enable                 */
#define  I2C_CR1_RXIE                        ((uint32_t)0x00000004)        /*!< RX interrupt enable                 */
#define  I2C_CR1_ADDRIE                      ((uint32_t)0x00000008)        /*!< Address match interrupt enable      */
#define  I2C_CR1_NACKIE                      ((uint32_t)0x00000010)        /*!< NACK received interrupt enable      */
#define  I2C_CR1_STOPIE                      ((uint32_t)0x00000020)        /*!< STOP detection interrupt enable     */
#define  I2C_CR1_TCIE                        ((uint32_t)0x00000040)        /*!< Transfer complete interrupt enable  */
#define  I2C_CR1_ERRIE                       ((uint32_t)0x00000080)        /*!< Errors interrupt enable             */
#define  I2C_CR1_DFN                         ((uint32_t)0x00000F00)        /*!< Digital noise filter                */
#define  I2C_CR1_ANFOFF                      ((uint32_t)0x00001000)        /*!< Analog noise filter OFF             */
#define  I2C_CR1_SWRST                       ((uint32_t)0x00002000)        /*!< Software reset                      */
#define  I2C_CR1_TXDMAEN                     ((uint32_t)0x00004000)        /*!< DMA transmission requests enable    */
#define  I2C_CR1_RXDMAEN                     ((uint32_t)0x00008000)        /*!< DMA reception requests enable       */
#define  I2C_CR1_SBC                         ((uint32_t)0x00010000)        /*!< Slave byte control                  */
#define  I2C_CR1_NOSTRETCH                   ((uint32_t)0x00020000)        /*!< Clock stretching disable            */
#define  I2C_CR1_WUPEN                       ((uint32_t)0x00040000)        /*!< Wakeup from STOP enable             */
#define  I2C_CR1_GCEN                        ((uint32_t)0x00080000)        /*!< General call enable                 */
#define  I2C_CR1_SMBHEN                      ((uint32_t)0x00100000)        /*!< SMBus host address enable           */
#define  I2C_CR1_SMBDEN                      ((uint32_t)0x00200000)        /*!< SMBus device default address enable */
#define  I2C_CR1_ALERTEN                     ((uint32_t)0x00400000)        /*!< SMBus alert enable                  */
#define  I2C_CR1_PECEN                       ((uint32_t)0x00800000)        /*!< PEC enable                          */

/******************  Bit definition for I2C_CR2 register  ********************/
#define  I2C_CR2_SADD                        ((uint32_t)0x000003FF)        /*!< Slave address (master mode)                             */
#define  I2C_CR2_RD_WRN                      ((uint32_t)0x00000400)        /*!< Transfer direction (master mode)                        */
#define  I2C_CR2_ADD10                       ((uint32_t)0x00000800)        /*!< 10-bit addressing mode (master mode)                    */
#define  I2C_CR2_HEAD10R                     ((uint32_t)0x00001000)        /*!< 10-bit address header only read direction (master mode) */
#define  I2C_CR2_START                       ((uint32_t)0x00002000)        /*!< START generation                                        */
#define  I2C_CR2_STOP                        ((uint32_t)0x00004000)        /*!< STOP generation (master mode)                           */
#define  I2C_CR2_NACK                        ((uint32_t)0x00008000)        /*!< NACK generation (slave mode)                            */
#define  I2C_CR2_NBYTES                      ((uint32_t)0x00FF0000)        /*!< Number of bytes                                         */
#define  I2C_CR2_RELOAD                      ((uint32_t)0x01000000)        /*!< NBYTES reload mode                                      */
#define  I2C_CR2_AUTOEND                     ((uint32_t)0x02000000)        /*!< Automatic end mode (master mode)                        */
#define  I2C_CR2_PECBYTE                     ((uint32_t)0x04000000)        /*!< Packet error checking byte                              */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define  I2C_OAR1_OA1                        ((uint32_t)0x000003FF)        /*!< Interface own address 1   */
#define  I2C_OAR1_OA1MODE                    ((uint32_t)0x00000400)        /*!< Own address 1 10-bit mode */
#define  I2C_OAR1_OA1EN                      ((uint32_t)0x00008000)        /*!< Own address 1 enable      */

