micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
#define  RCC_CR_PLLON                        ((uint32_t)0x01000000)       /*!< System PLL clock enable */
#define  RCC_CR_PLLRDY                       ((uint32_t)0x02000000)       /*!< System PLL clock ready */
#define  RCC_CR_PLLSAI1ON                    ((uint32_t)0x04000000)       /*!< SAI1 PLL enable */
#define  RCC_CR_PLLSAI1RDY                   ((uint32_t)0x08000000)       /*!< SAI1 PLL ready */
#define  RCC_CR_PLLSAI2ON                    ((uint32_t)0x10000000)       /*!< SAI2 PLL enable */
#define  RCC_CR_PLLSAI2RDY                   ((uint32_t)0x20000000)       /*!< SAI2 PLL ready */

/********************  Bit definition for RCC_ICSCR register  ***************/
/*!< MSICAL configuration */
#define  RCC_ICSCR_MSICAL                    ((uint32_t)0x000000FF)       /*!< MSICAL[7:0] bits */
#define  RCC_ICSCR_MSICAL_0                  ((uint32_t)0x00000001)       /*!<Bit 0 */
#define  RCC_ICSCR_MSICAL_1                  ((uint32_t)0x00000002)       /*!<Bit 1 */
#define  RCC_ICSCR_MSICAL_2                  ((uint32_t)0x00000004)       /*!<Bit 2 */
#define  RCC_ICSCR_MSICAL_3                  ((uint32_t)0x00000008)       /*!<Bit 3 */
#define  RCC_ICSCR_MSICAL_4                  ((uint32_t)0x00000010)       /*!<Bit 4 */
#define  RCC_ICSCR_MSICAL_5                  ((uint32_t)0x00000020)       /*!<Bit 5 */
#define  RCC_ICSCR_MSICAL_6                  ((uint32_t)0x00000040)       /*!<Bit 6 */
#define  RCC_ICSCR_MSICAL_7                  ((uint32_t)0x00000080)       /*!<Bit 7 */

/*!< MSITRIM configuration */
#define  RCC_ICSCR_MSITRIM                   ((uint32_t)0x0000FF00)       /*!< MSITRIM[7:0] bits */
#define  RCC_ICSCR_MSITRIM_0                 ((uint32_t)0x00000100)       /*!<Bit 0 */
#define  RCC_ICSCR_MSITRIM_1                 ((uint32_t)0x00000200)       /*!<Bit 1 */
#define  RCC_ICSCR_MSITRIM_2                 ((uint32_t)0x00000400)       /*!<Bit 2 */
#define  RCC_ICSCR_MSITRIM_3                 ((uint32_t)0x00000800)       /*!<Bit 3 */
#define  RCC_ICSCR_MSITRIM_4                 ((uint32_t)0x00001000)       /*!<Bit 4 */
#define  RCC_ICSCR_MSITRIM_5                 ((uint32_t)0x00002000)       /*!<Bit 5 */
#define  RCC_ICSCR_MSITRIM_6                 ((uint32_t)0x00004000)       /*!<Bit 6 */
#define  RCC_ICSCR_MSITRIM_7                 ((uint32_t)0x00008000)       /*!<Bit 7 */

/*!< HSICAL configuration */
#define  RCC_ICSCR_HSICAL                    ((uint32_t)0x00FF0000)       /*!< HSICAL[7:0] bits */
#define  RCC_ICSCR_HSICAL_0                  ((uint32_t)0x00010000)        /*!<Bit 0 */
#define  RCC_ICSCR_HSICAL_1                  ((uint32_t)0x00020000)        /*!<Bit 1 */
#define  RCC_ICSCR_HSICAL_2                  ((uint32_t)0x00040000)        /*!<Bit 2 */
#define  RCC_ICSCR_HSICAL_3                  ((uint32_t)0x00080000)        /*!<Bit 3 */
#define  RCC_ICSCR_HSICAL_4                  ((uint32_t)0x00100000)        /*!<Bit 4 */
#define  RCC_ICSCR_HSICAL_5                  ((uint32_t)0x00200000)        /*!<Bit 5 */
#define  RCC_ICSCR_HSICAL_6                  ((uint32_t)0x00400000)        /*!<Bit 6 */
#define  RCC_ICSCR_HSICAL_7                  ((uint32_t)0x00800000)        /*!<Bit 7 */

/*!< HSITRIM configuration */
#define  RCC_ICSCR_HSITRIM                   ((uint32_t)0x1F000000)       /*!< HSITRIM[7:0] bits */
#define  RCC_ICSCR_HSITRIM_0                 ((uint32_t)0x01000000)        /*!<Bit 0 */
#define  RCC_ICSCR_HSITRIM_1                 ((uint32_t)0x02000000)        /*!<Bit 1 */
#define  RCC_ICSCR_HSITRIM_2                 ((uint32_t)0x04000000)        /*!<Bit 2 */
#define  RCC_ICSCR_HSITRIM_3                 ((uint32_t)0x08000000)        /*!<Bit 3 */
#define  RCC_ICSCR_HSITRIM_4                 ((uint32_t)0x10000000)        /*!<Bit 4 */

/********************  Bit definition for RCC_PLLCFGR register  ***************/
#define  RCC_PLLCFGR_PLLSRC                  ((uint32_t)0x00000003)

#define  RCC_PLLCFGR_PLLSRC_MSI              ((uint32_t)0x00000001)      /*!< MSI source clock selected */
#define  RCC_PLLCFGR_PLLSRC_HSI              ((uint32_t)0x00000002)      /*!< HSI source clock selected */
#define  RCC_PLLCFGR_PLLSRC_HSE              ((uint32_t)0x00000003)      /*!< HSE source clock selected */

#define  RCC_PLLCFGR_PLLM                    ((uint32_t)0x00000070)
#define  RCC_PLLCFGR_PLLM_0                  ((uint32_t)0x00000010)
#define  RCC_PLLCFGR_PLLM_1                  ((uint32_t)0x00000020)
#define  RCC_PLLCFGR_PLLM_2                  ((uint32_t)0x00000040)

#define  RCC_PLLCFGR_PLLN                    ((uint32_t)0x00007F00)
#define  RCC_PLLCFGR_PLLN_0                  ((uint32_t)0x00000100)
#define  RCC_PLLCFGR_PLLN_1                  ((uint32_t)0x00000200)
#define  RCC_PLLCFGR_PLLN_2                  ((uint32_t)0x00000400)
#define  RCC_PLLCFGR_PLLN_3                  ((uint32_t)0x00000800)
#define  RCC_PLLCFGR_PLLN_4                  ((uint32_t)0x00001000)
#define  RCC_PLLCFGR_PLLN_5                  ((uint32_t)0x00002000)
#define  RCC_PLLCFGR_PLLN_6                  ((uint32_t)0x00004000)

#define  RCC_PLLCFGR_PLLPEN                  ((uint32_t)0x00010000)
#define  RCC_PLLCFGR_PLLP                    ((uint32_t)0x00020000)
#define  RCC_PLLCFGR_PLLQEN                  ((uint32_t)0x00100000)

#define  RCC_PLLCFGR_PLLQ                    ((uint32_t)0x00600000)
#define  RCC_PLLCFGR_PLLQ_0                  ((uint32_t)0x00200000)
#define  RCC_PLLCFGR_PLLQ_1                  ((uint32_t)0x00400000)

#define  RCC_PLLCFGR_PLLREN                  ((uint32_t)0x01000000)
#define  RCC_PLLCFGR_PLLR                    ((uint32_t)0x06000000)
#define  RCC_PLLCFGR_PLLR_0                  ((uint32_t)0x02000000)
#define  RCC_PLLCFGR_PLLR_1                  ((uint32_t)0x04000000)

/********************  Bit definition for RCC_CFGR register  ******************/
/*!< SW configuration */
#define  RCC_CFGR_SW                         ((uint32_t)0x00000003)      /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                       ((uint32_t)0x00000001)      /*!<Bit 0 */
#define  RCC_CFGR_SW_1                       ((uint32_t)0x00000002)      /*!<Bit 1 */

#define  RCC_CFGR_SW_MSI                     ((uint32_t)0x00000000)      /*!< MSI selection as system clock */
#define  RCC_CFGR_SW_HSI                     ((uint32_t)0x00000001)      /*!< HSI selection as system clock */
#define  RCC_CFGR_SW_HSE                     ((uint32_t)0x00000002)      /*!< HSE selection as system clock */
#define  RCC_CFGR_SW_PLL                     ((uint32_t)0x00000003)      /*!< PLL selection as system clock */

