micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
#define  RCC_CFGR_SWS_MSI                    ((uint32_t)0x00000000)      /*!< MSI used as system clock */
#define  RCC_CFGR_SWS_HSI                    ((uint32_t)0x00000004)      /*!< HSI used as system clock */
#define  RCC_CFGR_SWS_HSE                    ((uint32_t)0x00000008)      /*!< HSE used as system clock */
#define  RCC_CFGR_SWS_PLL                    ((uint32_t)0x0000000C)      /*!< PLL used as system clock */

/*!< SWS configuration */
#define  RCC_CFGR_SWS                        ((uint32_t)0x0000000C)      /*!< SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_CFGR_SWS_0                      ((uint32_t)0x00000004)      /*!<Bit 0 */
#define  RCC_CFGR_SWS_1                      ((uint32_t)0x00000008)      /*!<Bit 1 */

/*!< HPRE configuration */
#define  RCC_CFGR_HPRE                       ((uint32_t)0x000000F0)      /*!< HPRE[3:0] bits (AHB prescaler) */
#define  RCC_CFGR_HPRE_0                     ((uint32_t)0x00000010)      /*!<Bit 0 */
#define  RCC_CFGR_HPRE_1                     ((uint32_t)0x00000020)      /*!<Bit 1 */
#define  RCC_CFGR_HPRE_2                     ((uint32_t)0x00000040)      /*!<Bit 2 */
#define  RCC_CFGR_HPRE_3                     ((uint32_t)0x00000080)      /*!<Bit 3 */

#define  RCC_CFGR_HPRE_DIV1                  ((uint32_t)0x00000000)      /*!< SYSCLK not divided */
#define  RCC_CFGR_HPRE_DIV2                  ((uint32_t)0x00000080)      /*!< SYSCLK divided by 2 */
#define  RCC_CFGR_HPRE_DIV4                  ((uint32_t)0x00000090)      /*!< SYSCLK divided by 4 */
#define  RCC_CFGR_HPRE_DIV8                  ((uint32_t)0x000000A0)      /*!< SYSCLK divided by 8 */
#define  RCC_CFGR_HPRE_DIV16                 ((uint32_t)0x000000B0)      /*!< SYSCLK divided by 16 */
#define  RCC_CFGR_HPRE_DIV64                 ((uint32_t)0x000000C0)      /*!< SYSCLK divided by 64 */
#define  RCC_CFGR_HPRE_DIV128                ((uint32_t)0x000000D0)      /*!< SYSCLK divided by 128 */
#define  RCC_CFGR_HPRE_DIV256                ((uint32_t)0x000000E0)      /*!< SYSCLK divided by 256 */
#define  RCC_CFGR_HPRE_DIV512                ((uint32_t)0x000000F0)      /*!< SYSCLK divided by 512 */

/*!< PPRE1 configuration */
#define  RCC_CFGR_PPRE1                      ((uint32_t)0x00000700)      /*!< PRE1[2:0] bits (APB2 prescaler) */
#define  RCC_CFGR_PPRE1_0                    ((uint32_t)0x00000100)      /*!<Bit 0 */
#define  RCC_CFGR_PPRE1_1                    ((uint32_t)0x00000200)      /*!<Bit 1 */
#define  RCC_CFGR_PPRE1_2                    ((uint32_t)0x00000400)      /*!<Bit 2 */

#define  RCC_CFGR_PPRE1_DIV1                 ((uint32_t)0x00000000)      /*!< HCLK not divided */
#define  RCC_CFGR_PPRE1_DIV2                 ((uint32_t)0x00000400)      /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE1_DIV4                 ((uint32_t)0x00000500)      /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE1_DIV8                 ((uint32_t)0x00000600)      /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE1_DIV16                ((uint32_t)0x00000700)      /*!< HCLK divided by 16 */

/*!< PPRE2 configuration */
#define  RCC_CFGR_PPRE2                      ((uint32_t)0x00003800)      /*!< PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_CFGR_PPRE2_0                    ((uint32_t)0x00000800)      /*!<Bit 0 */
#define  RCC_CFGR_PPRE2_1                    ((uint32_t)0x00001000)      /*!<Bit 1 */
#define  RCC_CFGR_PPRE2_2                    ((uint32_t)0x00002000)      /*!<Bit 2 */

#define  RCC_CFGR_PPRE2_DIV1                 ((uint32_t)0x00000000)      /*!< HCLK not divided */
#define  RCC_CFGR_PPRE2_DIV2                 ((uint32_t)0x00002000)      /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE2_DIV4                 ((uint32_t)0x00002800)      /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE2_DIV8                 ((uint32_t)0x00003000)      /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE2_DIV16                ((uint32_t)0x00003800)      /*!< HCLK divided by 16 */

#define  RCC_CFGR_STOPWUCK                   ((uint32_t)0x00008000)      /*!< Wake Up from stop and CSS backup clock selection */

/*!< MCOSEL configuration */
#define  RCC_CFGR_MCOSEL                     ((uint32_t)0x07000000U)      /*!< MCOSEL [2:0] bits (Clock output selection) */
#define  RCC_CFGR_MCOSEL_0                   ((uint32_t)0x01000000U)      /*!<Bit 0 */
#define  RCC_CFGR_MCOSEL_1                   ((uint32_t)0x02000000U)      /*!<Bit 1 */
#define  RCC_CFGR_MCOSEL_2                   ((uint32_t)0x04000000U)      /*!<Bit 2 */

#define  RCC_CFGR_MCOPRE                     ((uint32_t)0x70000000U)      /*!< MCO prescaler */
#define  RCC_CFGR_MCOPRE_0                   ((uint32_t)0x10000000U)      /*!<Bit 0 */
#define  RCC_CFGR_MCOPRE_1                   ((uint32_t)0x20000000U)      /*!<Bit 1 */
#define  RCC_CFGR_MCOPRE_2                   ((uint32_t)0x40000000U)      /*!<Bit 2 */
 
#define  RCC_CFGR_MCOPRE_DIV1                ((uint32_t)0x00000000U)      /*!< MCO is divided by 1 */
#define  RCC_CFGR_MCOPRE_DIV2                ((uint32_t)0x10000000U)      /*!< MCO is divided by 2 */
#define  RCC_CFGR_MCOPRE_DIV4                ((uint32_t)0x20000000U)      /*!< MCO is divided by 4 */
#define  RCC_CFGR_MCOPRE_DIV8                ((uint32_t)0x30000000U)      /*!< MCO is divided by 8 */
#define  RCC_CFGR_MCOPRE_DIV16               ((uint32_t)0x40000000U)      /*!< MCO is divided by 16 */
 
/* Legacy aliases */
#define  RCC_CFGR_MCO_PRE                    RCC_CFGR_MCOPRE
#define  RCC_CFGR_MCO_PRE_1                  RCC_CFGR_MCOPRE_DIV1
#define  RCC_CFGR_MCO_PRE_2                  RCC_CFGR_MCOPRE_DIV2
#define  RCC_CFGR_MCO_PRE_4                  RCC_CFGR_MCOPRE_DIV4
#define  RCC_CFGR_MCO_PRE_8                  RCC_CFGR_MCOPRE_DIV8
#define  RCC_CFGR_MCO_PRE_16                 RCC_CFGR_MCOPRE_DIV16

/********************  Bit definition for RCC_CIER register  ******************/
#define  RCC_CIER_LSIRDYIE                   ((uint32_t)0x00000001)
#define  RCC_CIER_LSERDYIE                   ((uint32_t)0x00000002)
#define  RCC_CIER_MSIRDYIE                   ((uint32_t)0x00000004)
#define  RCC_CIER_HSIRDYIE                   ((uint32_t)0x00000008)
#define  RCC_CIER_HSERDYIE                   ((uint32_t)0x00000010)
#define  RCC_CIER_PLLRDYIE                   ((uint32_t)0x00000020)
#define  RCC_CIER_PLLSAI1RDYIE               ((uint32_t)0x00000040)
#define  RCC_CIER_PLLSAI2RDYIE               ((uint32_t)0x00000080)
#define  RCC_CIER_LSECSSIE                   ((uint32_t)0x00000200)

/********************  Bit definition for RCC_CIFR register  ******************/
#define  RCC_CIFR_LSIRDYF                    ((uint32_t)0x00000001)
#define  RCC_CIFR_LSERDYF                    ((uint32_t)0x00000002)
#define  RCC_CIFR_MSIRDYF                    ((uint32_t)0x00000004)
#define  RCC_CIFR_HSIRDYF                    ((uint32_t)0x00000008)
#define  RCC_CIFR_HSERDYF                    ((uint32_t)0x00000010)
#define  RCC_CIFR_PLLRDYF                    ((uint32_t)0x00000020)
#define  RCC_CIFR_PLLSAI1RDYF                ((uint32_t)0x00000040)
#define  RCC_CIFR_PLLSAI2RDYF                ((uint32_t)0x00000080)
#define  RCC_CIFR_CSSF                       ((uint32_t)0x00000100)
#define  RCC_CIFR_LSECSSF                    ((uint32_t)0x00000200)

/********************  Bit definition for RCC_CICR register  ******************/
#define  RCC_CICR_LSIRDYC                    ((uint32_t)0x00000001)
#define  RCC_CICR_LSERDYC                    ((uint32_t)0x00000002)
#define  RCC_CICR_MSIRDYC                    ((uint32_t)0x00000004)
#define  RCC_CICR_HSIRDYC                    ((uint32_t)0x00000008)
#define  RCC_CICR_HSERDYC                    ((uint32_t)0x00000010)
#define  RCC_CICR_PLLRDYC                    ((uint32_t)0x00000020)
#define  RCC_CICR_PLLSAI1RDYC                ((uint32_t)0x00000040)
#define  RCC_CICR_PLLSAI2RDYC                ((uint32_t)0x00000080)
#define  RCC_CICR_CSSC                       ((uint32_t)0x00000100)
#define  RCC_CICR_LSECSSC                    ((uint32_t)0x00000200)

/********************  Bit definition for RCC_AHB1RSTR register  **************/
#define  RCC_AHB1RSTR_DMA1RST                ((uint32_t)0x00000001)
#define  RCC_AHB1RSTR_DMA2RST                ((uint32_t)0x00000002)
#define  RCC_AHB1RSTR_FLASHRST               ((uint32_t)0x00000100)
#define  RCC_AHB1RSTR_CRCRST                 ((uint32_t)0x00001000)
#define  RCC_AHB1RSTR_TSCRST                 ((uint32_t)0x00010000)

/********************  Bit definition for RCC_AHB2RSTR register  **************/
#define  RCC_AHB2RSTR_GPIOARST               ((uint32_t)0x00000001)
#define  RCC_AHB2RSTR_GPIOBRST               ((uint32_t)0x00000002)
#define  RCC_AHB2RSTR_GPIOCRST               ((uint32_t)0x00000004)
#define  RCC_AHB2RSTR_GPIODRST               ((uint32_t)0x00000008)
#define  RCC_AHB2RSTR_GPIOERST               ((uint32_t)0x00000010)
#define  RCC_AHB2RSTR_GPIOFRST               ((uint32_t)0x00000020)
#define  RCC_AHB2RSTR_GPIOGRST               ((uint32_t)0x00000040)
#define  RCC_AHB2RSTR_GPIOHRST               ((uint32_t)0x00000080)
#define  RCC_AHB2RSTR_OTGFSRST               ((uint32_t)0x00001000)
#define  RCC_AHB2RSTR_ADCRST                 ((uint32_t)0x00002000)
#define  RCC_AHB2RSTR_RNGRST                 ((uint32_t)0x00040000)

/********************  Bit definition for RCC_AHB3RSTR register  **************/
#define  RCC_AHB3RSTR_FMCRST                 ((uint32_t)0x00000001)
#define  RCC_AHB3RSTR_QSPIRST                ((uint32_t)0x00000100)

/********************  Bit definition for RCC_APB1RSTR1 register  **************/
#define  RCC_APB1RSTR1_TIM2RST               ((uint32_t)0x00000001)
#define  RCC_APB1RSTR1_TIM3RST               ((uint32_t)0x00000002)
#define  RCC_APB1RSTR1_TIM4RST               ((uint32_t)0x00000004)
#define  RCC_APB1RSTR1_TIM5RST               ((uint32_t)0x00000008)
#define  RCC_APB1RSTR1_TIM6RST               ((uint32_t)0x00000010)
#define  RCC_APB1RSTR1_TIM7RST               ((uint32_t)0x00000020)
#define  RCC_APB1RSTR1_SPI2RST               ((uint32_t)0x00004000)
#define  RCC_APB1RSTR1_SPI3RST               ((uint32_t)0x00008000)
#define  RCC_APB1RSTR1_USART2RST             ((uint32_t)0x00020000)
#define  RCC_APB1RSTR1_USART3RST             ((uint32_t)0x00040000)
#define  RCC_APB1RSTR1_UART4RST              ((uint32_t)0x00080000)
#define  RCC_APB1RSTR1_UART5RST              ((uint32_t)0x00100000)
#define  RCC_APB1RSTR1_I2C1RST               ((uint32_t)0x00200000)
#define  RCC_APB1RSTR1_I2C2RST               ((uint32_t)0x00400000)
#define  RCC_APB1RSTR1_I2C3RST               ((uint32_t)0x00800000)
#define  RCC_APB1RSTR1_CAN1RST               ((uint32_t)0x02000000)
#define  RCC_APB1RSTR1_PWRRST                ((uint32_t)0x10000000)
#define  RCC_APB1RSTR1_DAC1RST               ((uint32_t)0x20000000)
#define  RCC_APB1RSTR1_OPAMPRST              ((uint32_t)0x40000000)
#define  RCC_APB1RSTR1_LPTIM1RST             ((uint32_t)0x80000000)

/********************  Bit definition for RCC_APB1RSTR2 register  **************/
#define  RCC_APB1RSTR2_LPUART1RST            ((uint32_t)0x00000001)
#define  RCC_APB1RSTR2_SWPMI1RST             ((uint32_t)0x00000004)
#define  RCC_APB1RSTR2_LPTIM2RST             ((uint32_t)0x00000020)

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define  RCC_APB2RSTR_SYSCFGRST              ((uint32_t)0x00000001)
#define  RCC_APB2RSTR_SDMMC1RST              ((uint32_t)0x00000400)
#define  RCC_APB2RSTR_TIM1RST                ((uint32_t)0x00000800)
#define  RCC_APB2RSTR_SPI1RST                ((uint32_t)0x00001000)
#define  RCC_APB2RSTR_TIM8RST                ((uint32_t)0x00002000)
#define  RCC_APB2RSTR_USART1RST              ((uint32_t)0x00004000)
#define  RCC_APB2RSTR_TIM15RST               ((uint32_t)0x00010000)
#define  RCC_APB2RSTR_TIM16RST               ((uint32_t)0x00020000)
#define  RCC_APB2RSTR_TIM17RST               ((uint32_t)0x00040000)
#define  RCC_APB2RSTR_SAI1RST                ((uint32_t)0x00200000)
#define  RCC_APB2RSTR_SAI2RST                ((uint32_t)0x00400000)
#define  RCC_APB2RSTR_DFSDMRST               ((uint32_t)0x01000000)

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define  RCC_AHB1ENR_DMA1EN                  ((uint32_t)0x00000001)
#define  RCC_AHB1ENR_DMA2EN                  ((uint32_t)0x00000002)
#define  RCC_AHB1ENR_FLASHEN                 ((uint32_t)0x00000100)
#define  RCC_AHB1ENR_CRCEN                   ((uint32_t)0x00001000)
#define  RCC_AHB1ENR_TSCEN                   ((uint32_t)0x00010000)

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define  RCC_AHB2ENR_GPIOAEN                 ((uint32_t)0x00000001)
#define  RCC_AHB2ENR_GPIOBEN                 ((uint32_t)0x00000002)
#define  RCC_AHB2ENR_GPIOCEN                 ((uint32_t)0x00000004)
#define  RCC_AHB2ENR_GPIODEN                 ((uint32_t)0x00000008)
#define  RCC_AHB2ENR_GPIOEEN                 ((uint32_t)0x00000010)
#define  RCC_AHB2ENR_GPIOFEN                 ((uint32_t)0x00000020)
#define  RCC_AHB2ENR_GPIOGEN                 ((uint32_t)0x00000040)
#define  RCC_AHB2ENR_GPIOHEN                 ((uint32_t)0x00000080)
#define  RCC_AHB2ENR_OTGFSEN                 ((uint32_t)0x00001000)
#define  RCC_AHB2ENR_ADCEN                   ((uint32_t)0x00002000)
#define  RCC_AHB2ENR_RNGEN                   ((uint32_t)0x00040000)

