micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
#define  RCC_CCIPR_USART2SEL                 ((uint32_t)0x0000000C)
#define  RCC_CCIPR_USART2SEL_0               ((uint32_t)0x00000004)
#define  RCC_CCIPR_USART2SEL_1               ((uint32_t)0x00000008)

#define  RCC_CCIPR_USART3SEL                 ((uint32_t)0x00000030)
#define  RCC_CCIPR_USART3SEL_0               ((uint32_t)0x00000010)
#define  RCC_CCIPR_USART3SEL_1               ((uint32_t)0x00000020)

#define  RCC_CCIPR_UART4SEL                  ((uint32_t)0x000000C0)
#define  RCC_CCIPR_UART4SEL_0                ((uint32_t)0x00000040)
#define  RCC_CCIPR_UART4SEL_1                ((uint32_t)0x00000080)

#define  RCC_CCIPR_UART5SEL                  ((uint32_t)0x00000300)
#define  RCC_CCIPR_UART5SEL_0                ((uint32_t)0x00000100)
#define  RCC_CCIPR_UART5SEL_1                ((uint32_t)0x00000200)

#define  RCC_CCIPR_LPUART1SEL                ((uint32_t)0x00000C00)
#define  RCC_CCIPR_LPUART1SEL_0              ((uint32_t)0x00000400)
#define  RCC_CCIPR_LPUART1SEL_1              ((uint32_t)0x00000800)

#define  RCC_CCIPR_I2C1SEL                   ((uint32_t)0x00003000)
#define  RCC_CCIPR_I2C1SEL_0                 ((uint32_t)0x00001000)
#define  RCC_CCIPR_I2C1SEL_1                 ((uint32_t)0x00002000)

#define  RCC_CCIPR_I2C2SEL                   ((uint32_t)0x0000C000)
#define  RCC_CCIPR_I2C2SEL_0                 ((uint32_t)0x00004000)
#define  RCC_CCIPR_I2C2SEL_1                 ((uint32_t)0x00008000)

#define  RCC_CCIPR_I2C3SEL                   ((uint32_t)0x00030000)
#define  RCC_CCIPR_I2C3SEL_0                 ((uint32_t)0x00010000)
#define  RCC_CCIPR_I2C3SEL_1                 ((uint32_t)0x00020000)

#define  RCC_CCIPR_LPTIM1SEL                 ((uint32_t)0x000C0000)
#define  RCC_CCIPR_LPTIM1SEL_0               ((uint32_t)0x00040000)
#define  RCC_CCIPR_LPTIM1SEL_1               ((uint32_t)0x00080000)

#define  RCC_CCIPR_LPTIM2SEL                 ((uint32_t)0x00300000)
#define  RCC_CCIPR_LPTIM2SEL_0               ((uint32_t)0x00100000)
#define  RCC_CCIPR_LPTIM2SEL_1               ((uint32_t)0x00200000)

#define  RCC_CCIPR_SAI1SEL                   ((uint32_t)0x00C00000)
#define  RCC_CCIPR_SAI1SEL_0                 ((uint32_t)0x00400000)
#define  RCC_CCIPR_SAI1SEL_1                 ((uint32_t)0x00800000)

#define  RCC_CCIPR_SAI2SEL                   ((uint32_t)0x03000000)
#define  RCC_CCIPR_SAI2SEL_0                 ((uint32_t)0x01000000)
#define  RCC_CCIPR_SAI2SEL_1                 ((uint32_t)0x02000000)

#define  RCC_CCIPR_CLK48SEL                  ((uint32_t)0x0C000000)
#define  RCC_CCIPR_CLK48SEL_0                ((uint32_t)0x04000000)
#define  RCC_CCIPR_CLK48SEL_1                ((uint32_t)0x08000000)

#define  RCC_CCIPR_ADCSEL                    ((uint32_t)0x30000000)
#define  RCC_CCIPR_ADCSEL_0                  ((uint32_t)0x10000000)
#define  RCC_CCIPR_ADCSEL_1                  ((uint32_t)0x20000000)

#define  RCC_CCIPR_SWPMI1SEL                 ((uint32_t)0x40000000)
#define  RCC_CCIPR_DFSDMSEL                  ((uint32_t)0x80000000)

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSEON                      ((uint32_t)0x00000001)
#define  RCC_BDCR_LSERDY                     ((uint32_t)0x00000002)
#define  RCC_BDCR_LSEBYP                     ((uint32_t)0x00000004)

#define  RCC_BDCR_LSEDRV                     ((uint32_t)0x00000018)
#define  RCC_BDCR_LSEDRV_0                   ((uint32_t)0x00000008)
#define  RCC_BDCR_LSEDRV_1                   ((uint32_t)0x00000010)

#define  RCC_BDCR_LSECSSON                   ((uint32_t)0x00000020)
#define  RCC_BDCR_LSECSSD                    ((uint32_t)0x00000040)

#define  RCC_BDCR_RTCSEL                     ((uint32_t)0x00000300)
#define  RCC_BDCR_RTCSEL_0                   ((uint32_t)0x00000100)
#define  RCC_BDCR_RTCSEL_1                   ((uint32_t)0x00000200)

#define  RCC_BDCR_RTCEN                      ((uint32_t)0x00008000)
#define  RCC_BDCR_BDRST                      ((uint32_t)0x00010000)
#define  RCC_BDCR_LSCOEN                     ((uint32_t)0x01000000)
#define  RCC_BDCR_LSCOSEL                    ((uint32_t)0x02000000)

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION                       ((uint32_t)0x00000001)
#define  RCC_CSR_LSIRDY                      ((uint32_t)0x00000002)

#define  RCC_CSR_MSISRANGE                   ((uint32_t)0x00000F00)
#define  RCC_CSR_MSISRANGE_1                 ((uint32_t)0x00000400)      /*!< MSI frequency 1MHZ */
#define  RCC_CSR_MSISRANGE_2                 ((uint32_t)0x00000500)      /*!< MSI frequency 2MHZ */
#define  RCC_CSR_MSISRANGE_4                 ((uint32_t)0x00000600)      /*!< The default frequency 4MHZ */
#define  RCC_CSR_MSISRANGE_8                 ((uint32_t)0x00000700)      /*!< MSI frequency 8MHZ */

#define  RCC_CSR_RMVF                        ((uint32_t)0x00800000)
#define  RCC_CSR_FWRSTF                      ((uint32_t)0x01000000)
#define  RCC_CSR_OBLRSTF                     ((uint32_t)0x02000000)
#define  RCC_CSR_PINRSTF                     ((uint32_t)0x04000000)
#define  RCC_CSR_BORRSTF                     ((uint32_t)0x08000000)
#define  RCC_CSR_SFTRSTF                     ((uint32_t)0x10000000)
#define  RCC_CSR_IWDGRSTF                    ((uint32_t)0x20000000)
#define  RCC_CSR_WWDGRSTF                    ((uint32_t)0x40000000)
#define  RCC_CSR_LPWRRSTF                    ((uint32_t)0x80000000)

/********************  Bit definition for RCC_PLLSAI1CFGR register  ************/
#define  RCC_PLLSAI1CFGR_PLLSAI1N            ((uint32_t)0x00007F00)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_0          ((uint32_t)0x00000100)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_1          ((uint32_t)0x00000200)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_2          ((uint32_t)0x00000400)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_3          ((uint32_t)0x00000800)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_4          ((uint32_t)0x00001000)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_5          ((uint32_t)0x00002000)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_6          ((uint32_t)0x00004000)

