micropython/micropython/stmhal/cmsis/devinc/stm32l475xx.h
/********************  Bit definition for USB_OTG_GRXSTSP register  ********************/
#define USB_OTG_GRXSTSP_EPNUM                    ((uint32_t)0x0000000F)        /*!< IN EP interrupt mask bits */
#define USB_OTG_GRXSTSP_BCNT                     ((uint32_t)0x00007FF0)        /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_DPID                     ((uint32_t)0x00018000)        /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_PKTSTS                   ((uint32_t)0x001E0000)        /*!< OUT EP interrupt mask bits */

/********************  Bit definition for USB_OTG_DAINTMSK register  ********************/
#define USB_OTG_DAINTMSK_IEPM                    ((uint32_t)0x0000FFFF)        /*!< IN EP interrupt mask bits */
#define USB_OTG_DAINTMSK_OEPM                    ((uint32_t)0xFFFF0000)        /*!< OUT EP interrupt mask bits */

/********************  Bit definition for OTG register  ********************/

#define USB_OTG_CHNUM                   ((uint32_t)0x0000000F)                 /*!< Channel number */
#define USB_OTG_CHNUM_0                 ((uint32_t)0x00000001)                 /*!<Bit 0 */
#define USB_OTG_CHNUM_1                 ((uint32_t)0x00000002)                 /*!<Bit 1 */
#define USB_OTG_CHNUM_2                 ((uint32_t)0x00000004)                 /*!<Bit 2 */
#define USB_OTG_CHNUM_3                 ((uint32_t)0x00000008)                 /*!<Bit 3 */
#define USB_OTG_BCNT                    ((uint32_t)0x00007FF0)                 /*!< Byte count */                                                                             
#define USB_OTG_DPID                    ((uint32_t)0x00018000)                 /*!< Data PID */
#define USB_OTG_DPID_0                  ((uint32_t)0x00008000)                 /*!<Bit 0 */
#define USB_OTG_DPID_1                  ((uint32_t)0x00010000)                 /*!<Bit 1 */                                                                           
#define USB_OTG_PKTSTS                  ((uint32_t)0x001E0000)                 /*!< Packet status */
#define USB_OTG_PKTSTS_0                ((uint32_t)0x00020000)                 /*!<Bit 0 */
#define USB_OTG_PKTSTS_1                ((uint32_t)0x00040000)                 /*!<Bit 1 */
#define USB_OTG_PKTSTS_2                ((uint32_t)0x00080000)                 /*!<Bit 2 */
#define USB_OTG_PKTSTS_3                ((uint32_t)0x00100000)                 /*!<Bit 3 */                                                                         
#define USB_OTG_EPNUM                   ((uint32_t)0x0000000F)                 /*!< Endpoint number */
#define USB_OTG_EPNUM_0                 ((uint32_t)0x00000001)                 /*!<Bit 0 */
#define USB_OTG_EPNUM_1                 ((uint32_t)0x00000002)                 /*!<Bit 1 */
#define USB_OTG_EPNUM_2                 ((uint32_t)0x00000004)                 /*!<Bit 2 */
#define USB_OTG_EPNUM_3                 ((uint32_t)0x00000008)                 /*!<Bit 3 */                                                                            
#define USB_OTG_FRMNUM                  ((uint32_t)0x01E00000)                 /*!< Frame number */
#define USB_OTG_FRMNUM_0                ((uint32_t)0x00200000)                 /*!<Bit 0 */
#define USB_OTG_FRMNUM_1                ((uint32_t)0x00400000)                 /*!<Bit 1 */
#define USB_OTG_FRMNUM_2                ((uint32_t)0x00800000)                 /*!<Bit 2 */
#define USB_OTG_FRMNUM_3                ((uint32_t)0x01000000)                 /*!<Bit 3 */

/********************  Bit definition for OTG register  ********************/

#define USB_OTG_CHNUM                   ((uint32_t)0x0000000F)                 /*!< Channel number */
#define USB_OTG_CHNUM_0                 ((uint32_t)0x00000001)                 /*!<Bit 0 */
#define USB_OTG_CHNUM_1                 ((uint32_t)0x00000002)                 /*!<Bit 1 */
#define USB_OTG_CHNUM_2                 ((uint32_t)0x00000004)                 /*!<Bit 2 */
#define USB_OTG_CHNUM_3                 ((uint32_t)0x00000008)                 /*!<Bit 3 */
#define USB_OTG_BCNT                    ((uint32_t)0x00007FF0)                 /*!< Byte count */                                                                         
#define USB_OTG_DPID                    ((uint32_t)0x00018000)                 /*!< Data PID */
#define USB_OTG_DPID_0                  ((uint32_t)0x00008000)                 /*!<Bit 0 */
#define USB_OTG_DPID_1                  ((uint32_t)0x00010000)                 /*!<Bit 1 */                                                                         
#define USB_OTG_PKTSTS                  ((uint32_t)0x001E0000)                 /*!< Packet status */
#define USB_OTG_PKTSTS_0                ((uint32_t)0x00020000)                 /*!<Bit 0 */
#define USB_OTG_PKTSTS_1                ((uint32_t)0x00040000)                 /*!<Bit 1 */
#define USB_OTG_PKTSTS_2                ((uint32_t)0x00080000)                 /*!<Bit 2 */
#define USB_OTG_PKTSTS_3                ((uint32_t)0x00100000)                 /*!<Bit 3 */                                                                            
#define USB_OTG_EPNUM                   ((uint32_t)0x0000000F)                 /*!< Endpoint number */
#define USB_OTG_EPNUM_0                 ((uint32_t)0x00000001)                 /*!<Bit 0 */
#define USB_OTG_EPNUM_1                 ((uint32_t)0x00000002)                 /*!<Bit 1 */
#define USB_OTG_EPNUM_2                 ((uint32_t)0x00000004)                 /*!<Bit 2 */
#define USB_OTG_EPNUM_3                 ((uint32_t)0x00000008)                 /*!<Bit 3 */                                                                             
#define USB_OTG_FRMNUM                  ((uint32_t)0x01E00000)                 /*!< Frame number */
#define USB_OTG_FRMNUM_0                ((uint32_t)0x00200000)                 /*!<Bit 0 */
#define USB_OTG_FRMNUM_1                ((uint32_t)0x00400000)                 /*!<Bit 1 */
#define USB_OTG_FRMNUM_2                ((uint32_t)0x00800000)                 /*!<Bit 2 */
#define USB_OTG_FRMNUM_3                ((uint32_t)0x01000000)                 /*!<Bit 3 */

